app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows` FROM `galleries`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT *
FROM `galleries`
ORDER BY `tanggal_diambil` DESC
 LIMIT 5
---
    public function index()
    {
        $data = [
            'total_galleries' => $this->galleryModel->countAll(),
            'total_categories' => $this->categoryModel->countAll(),
            'recent_galleries' => $this->galleryModel->orderBy('tanggal_diambil', 'DESC')->limit(5)->find(),
        ];