app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `email` = 'admin@bulog.com'
 LIMIT 1
---
public function loginProcess()
{
    $rules = [
        'email' => 'required|valid_email',
        'password' => 'required|min_length[6]'
    ];

    if (!$this->validate($rules)) {
        return redirect()->back()
            ->withInput()
            ->with('errors', $this->validator->getErrors());
    }

    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $user = $this->userModel->where('email', $email)->first();