app/Controllers/CategoriesController.php

    public function index()
    {
        $data['categories'] = $this->categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function store()
    {
        if (!$this->validate(['nama_kategori' => 'required'])) {
            return redirect()->back()->with('error', 'Nama kategori harus diisi');
        }

        $this->categoryModel->save([
            'nama_kategori' => $this->request->getPost('nama_kategori')
        ]);
---
INSERT INTO `categories` (`nama_kategori`) VALUES ('Survey Gabah')