app/Controllers/GalleriesController.php

    public function index()
    {
        // Ambil parameter filter & sort
        $sort           = $this->request->getGet('sort') ?? 'desc';
        $filterKategori = $this->request->getGet('filter_kategori');   // new
        $filterTanggal  = $this->request->getGet('filter_tanggal');    // new

        // Pagination
        $page    = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 5;
        $offset  = ($page - 1) * $perPage;

        // Bangun query dasar
        $galleryQuery = $this->galleryModel
            ->select('galleries.*, categories.nama_kategori')
            ->join('categories', 'categories.id = galleries.kategori_id', 'left')
            ->orderBy('galleries.tanggal_diambil', $sort);

        // Terapkan filter kategori jika ada
        if ($filterKategori) {
            $galleryQuery->where('galleries.kategori_id', $filterKategori);
        }

        // Terapkan filter tanggal jika ada
        if ($filterTanggal) {
            $galleryQuery->where('galleries.tanggal_diambil', $filterTanggal);
        }

        // Hitung total & ambil data
        $total = $galleryQuery->countAllResults(false);
        $galleries = $galleryQuery->findAll($perPage, $offset);
---
SELECT `galleries`.*, `categories`.`nama_kategori`
FROM `galleries`
LEFT JOIN `categories` ON `categories`.`id` = `galleries`.`kategori_id`
ORDER BY `galleries`.`tanggal_diambil` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `galleries`
LEFT JOIN `categories` ON `categories`.`id` = `galleries`.`kategori_id`

    public function create()
    {
        $data['categories'] = $this->categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function store()
{
    $rules = [
        'nama_foto'       => 'required',
        'deskripsi'       => 'required',
        'tanggal_diambil' => 'required|valid_date[Y-m-d]',
        'kategori_id'     => 'required|integer',
        'foto'            => 'uploaded[foto.0]', // Minimal 1 file
        'foto.*'          => 'permit_empty|is_image[foto.*]|max_size[foto.*,5120]',
    ];

    if (!$this->validate($rules)) {
        return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
    }

    $kategori = $this->request->getPost('kategori_id');
    $category = $this->categoryModel->find($kategori);
---
SELECT *
FROM `categories`
WHERE `categories`.`id` = '7'