app/Controllers/GalleriesController.php

SELECT COUNT(*) AS `numrows`
FROM `galleries`
LEFT JOIN `categories` ON `categories`.`id` = `galleries`.`kategori_id`
SELECT `galleries`.*, `categories`.`nama_kategori`
FROM `galleries`
LEFT JOIN `categories` ON `categories`.`id` = `galleries`.`kategori_id`
ORDER BY `galleries`.`tanggal_diambil` DESC
 LIMIT 5
---
    public function index()
    {
        $sort = $this->request->getGet('sort') ?? 'desc'; // Default: Terbaru
        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 5; // Batasi 5 data per halaman
        $offset = ($page - 1) * $perPage;

        $galleryQuery = $this->galleryModel
            ->select('galleries.*, categories.nama_kategori')
            ->join('categories', 'categories.id = galleries.kategori_id', 'left')
            ->orderBy('galleries.tanggal_diambil', $sort);

        $data['total'] = $galleryQuery->countAllResults(false);
        $data['galleries'] = $galleryQuery->findAll($perPage, $offset);

SELECT *
FROM `categories`
---
    public function create()
    {
        $data['categories'] = $this->categoryModel->findAll();

SELECT *
FROM `galleries`
WHERE `galleries`.`id` = '2'
SELECT *
FROM `categories`
---
    public function edit($id)
    {
        $data['gallery'] = $this->galleryModel->find($id);
        if (!$data['gallery']) {
            return redirect()->to('/admin/galleries')->with('error', 'Foto tidak ditemukan');
        }

        $data['categories'] = $this->categoryModel->findAll();

SELECT *
FROM `galleries`
WHERE `galleries`.`id` = '4'
DELETE FROM `galleries`
WHERE `id` IN ('4')
---
    public function delete($id)
    {
        $gallery = $this->galleryModel->find($id);
        if (!$gallery) {
            return redirect()->to('/admin/galleries')->with('error', 'Foto tidak ditemukan');
        }

        if (file_exists($gallery['foto'])) {
            unlink($gallery['foto']);
        }

        $this->galleryModel->delete($id);