app/Controllers/HomeController.php

    public function index()
{
    $today     = date('Y-m-d');
    $threeDaysAgo = date('Y-m-d', strtotime('-3 days'));

    // Ambil kategori
    $categoriesModel = new \App\Models\CategoriesModel();
    $categories = $categoriesModel->findAll();

    // Ambil parameter filter
    $sort = $this->request->getGet('sort') ?? 'all';
    $page = $this->request->getGet('page') ?? 1;
    $perPage = 9;

    // Query dasar
    $galleryQuery = $this->galleryModel
        ->select('galleries.*, categories.nama_kategori')
        ->join('categories', 'categories.id = galleries.kategori_id', 'left')
        ->orderBy('galleries.tanggal_diambil', 'DESC');

    // Filter berdasarkan News / Old
    if ($sort === 'new') {
        $galleryQuery->where('galleries.tanggal_diambil >=', $threeDaysAgo);
    } elseif ($sort === 'old') {
        $galleryQuery->where('galleries.tanggal_diambil <', $threeDaysAgo);
    }

    // Pagination
    $totalGalleries = $galleryQuery->countAllResults(false);
    $galleries = $galleryQuery->paginate($perPage, 'default', $page);
---
SELECT *
FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `galleries`
LEFT JOIN `categories` ON `categories`.`id` = `galleries`.`kategori_id`
SELECT `galleries`.*, `categories`.`nama_kategori`
FROM `galleries`
LEFT JOIN `categories` ON `categories`.`id` = `galleries`.`kategori_id`
ORDER BY `galleries`.`tanggal_diambil` DESC
 LIMIT 9