app/Controllers/ProfileController.php

    public function index()
    {
        $data = [
            'title' => 'My Profile',
            'user' => $this->userModel->find(session('user_id'))
---
SELECT *
FROM `user`
WHERE `user`.`id` = '2'

    public function edit()
    {
        $data = [
            'title' => 'Edit Profile',
            'user' => $this->userModel->find(session('user_id')),
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'

    public function update()
    {
        $userId = session('user_id');
        $user = $this->userModel->find($userId);

        $rules = [
            'username' => "required|min_length[3]|max_length[100]|is_unique[user.username,id,$userId]",
            'email' => "required|valid_email|is_unique[user.email,id,$userId]"
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'username' => $this->request->getPost('username'),
            'email' => $this->request->getPost('email')
        ];

        $this->userModel->update($userId, $data);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'
UPDATE `user` SET `username` = 'admin', `email` = 'admin@bulog.com', `updated_at` = '2025-05-30 09:57:15'
WHERE `user`.`id` IN ('1')

public function uploadPhoto()
{
    $userId = session('user_id');
    $user = $this->userModel->find($userId);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'