app/Controllers/UsersController.php

    public function index()
    {
        $data = [
            'users' => $this->userModel->findAll()
        ];
---
SELECT *
FROM `user`

    public function toggleStatus($id)
    {
        $user = $this->userModel->find($id);
        $status = $user['status_aktif'] ? 0 : 1;
        $this->userModel->update($id, ['status_aktif' => $status]);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'
UPDATE `user` SET `status_aktif` = 0, `updated_at` = '2025-05-21 10:08:52'
WHERE `user`.`id` IN ('1')